0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	 version 2.0;
	 format ascii;
	 class volVectorField;
	 object U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions [0 1 -1 0 0 0 0];

internalField uniform (0 0 0);

boundaryField
{
    frontBack
    {
        type            empty;
    }
    WALL
    {
        type            noSlip;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    INLET
    {
        type            fixedValue;
		value			uniform (0.0375 0 0);
    }
    PRISM
    {
        type            noSlip;
    }
}

// ************************************************************************* //