0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298;

boundaryField
{
    frontBack
    {
        type            empty;
    }
    WALL
    {
        type            fixedValue;
        value           uniform 298;
    }
    OUTLET
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    INLET
    {
        type            fixedValue;
        value           uniform 298;
    }
    PRISM
    {
        type            fixedValue;
        value           uniform 473;
    }
}


// ************************************************************************* //
